#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Pusher: logica0419, Action: `pull_request`

<details><summary>Show Plan</summary>

```text
terraform
data.sakuracloud_archive.ubuntu_archive: Reading...
sakuracloud_ssh_key_gen.gen_key: Refreshing state... [id=113601808156]
sakuracloud_disk.k8s_rook_disk[3]: Refreshing state... [id=113601808157]
sakuracloud_disk.k8s_rook_disk[6]: Refreshing state... [id=113601808168]
sakuracloud_disk.k8s_rook_disk[2]: Refreshing state... [id=113601808172]
sakuracloud_disk.k8s_rook_disk[4]: Refreshing state... [id=113601808165]
sakuracloud_disk.k8s_rook_disk[0]: Refreshing state... [id=113601808171]
sakuracloud_disk.k8s_rook_disk[7]: Refreshing state... [id=113601808170]
sakuracloud_internet.k8s_external_switch: Refreshing state... [id=113601808166]
sakuracloud_disk.k8s_rook_disk[5]: Refreshing state... [id=113601808160]
data.sakuracloud_archive.ubuntu_archive: Read complete after 0s [id=113600510456]
sakuracloud_switch.k8s_internal_switch: Refreshing state... [id=113601808159]
sakuracloud_disk.k8s_rook_disk[1]: Refreshing state... [id=113601808164]
sakuracloud_disk.k8s_router_disk[0]: Refreshing state... [id=113601808158]
sakuracloud_disk.k8s_worker_node_disk[5]: Refreshing state... [id=113601808173]
sakuracloud_disk.k8s_worker_node_disk[7]: Refreshing state... [id=113601808176]
sakuracloud_disk.k8s_worker_node_disk[3]: Refreshing state... [id=113601808179]
sakuracloud_disk.k8s_worker_node_disk[0]: Refreshing state... [id=113601808178]
sakuracloud_disk.k8s_worker_node_disk[6]: Refreshing state... [id=113601808188]
sakuracloud_disk.k8s_worker_node_disk[1]: Refreshing state... [id=113601808177]
sakuracloud_disk.k8s_worker_node_disk[4]: Refreshing state... [id=113601808187]
sakuracloud_disk.k8s_worker_node_disk[2]: Refreshing state... [id=113601808175]
sakuracloud_disk.k8s_control_plane_disk[1]: Refreshing state... [id=113601808162]
sakuracloud_disk.k8s_control_plane_disk[0]: Refreshing state... [id=113601808163]
sakuracloud_disk.k8s_control_plane_disk[2]: Refreshing state... [id=113601808161]
sakuracloud_server.k8s_router[0]: Refreshing state... [id=113601808189]
sakuracloud_server.k8s_control_plane[0]: Refreshing state... [id=113601808193]
sakuracloud_server.k8s_worker_node[7]: Refreshing state... [id=113601808205]
sakuracloud_server.k8s_control_plane[1]: Refreshing state... [id=113601808194]
sakuracloud_server.k8s_control_plane[2]: Refreshing state... [id=113601808192]
sakuracloud_server.k8s_worker_node[0]: Refreshing state... [id=113601808203]
sakuracloud_server.k8s_worker_node[1]: Refreshing state... [id=113601808201]
sakuracloud_server.k8s_worker_node[6]: Refreshing state... [id=113601808219]
sakuracloud_server.k8s_worker_node[2]: Refreshing state... [id=113601808223]
sakuracloud_server.k8s_worker_node[3]: Refreshing state... [id=113601808204]
sakuracloud_server.k8s_worker_node[4]: Refreshing state... [id=113601808202]
sakuracloud_server.k8s_worker_node[5]: Refreshing state... [id=113601808206]
sakuracloud_subnet.bgp_subnet: Refreshing state... [id=19802]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # sakuracloud_disk.k8s_control_plane_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113601808163" -> (known after apply)
        name                 = "k8s-dev-control-plane-1"
      ~ server_id            = "113601808193" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113601808162" -> (known after apply)
        name                 = "k8s-dev-control-plane-2"
      ~ server_id            = "113601808194" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113601808161" -> (known after apply)
        name                 = "k8s-dev-control-plane-3"
      ~ server_id            = "113601808192" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_router_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_router_disk" {
      ~ id                   = "113601808158" -> (known after apply)
        name                 = "k8s-dev-router-1"
      ~ server_id            = "113601808189" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601808178" -> (known after apply)
        name                 = "k8s-dev-worker-node-1"
      ~ server_id            = "113601808203" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601808177" -> (known after apply)
        name                 = "k8s-dev-worker-node-2"
      ~ server_id            = "113601808201" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601808175" -> (known after apply)
        name                 = "k8s-dev-worker-node-3"
      ~ server_id            = "113601808223" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[3] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601808179" -> (known after apply)
        name                 = "k8s-dev-worker-node-4"
      ~ server_id            = "113601808204" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[4] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601808187" -> (known after apply)
        name                 = "k8s-dev-worker-node-5"
      ~ server_id            = "113601808202" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[5] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601808173" -> (known after apply)
        name                 = "k8s-dev-worker-node-6"
      ~ server_id            = "113601808206" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[6] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601808188" -> (known after apply)
        name                 = "k8s-dev-worker-node-7"
      ~ server_id            = "113601808219" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[7] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601808176" -> (known after apply)
        name                 = "k8s-dev-worker-node-8"
      ~ server_id            = "113601808205" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_server.k8s_control_plane[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113601808163",
        ] -> (known after apply)
        id                = "113601808193"
        name              = "k8s-dev-control-plane-1"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113601808162",
        ] -> (known after apply)
        id                = "113601808194"
        name              = "k8s-dev-control-plane-2"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113601808161",
        ] -> (known after apply)
        id                = "113601808192"
        name              = "k8s-dev-control-plane-3"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_router[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_router" {
      ~ disks             = [
          - "113601808158",
        ] -> (known after apply)
        id                = "113601808189"
        name              = "k8s-dev-router-1"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601808178",
          - "113601808171",
        ] -> (known after apply)
        id                = "113601808203"
        name              = "k8s-dev-worker-node-1"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601808177",
          - "113601808164",
        ] -> (known after apply)
        id                = "113601808201"
        name              = "k8s-dev-worker-node-2"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601808175",
          - "113601808172",
        ] -> (known after apply)
        id                = "113601808223"
        name              = "k8s-dev-worker-node-3"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[3] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601808179",
          - "113601808157",
        ] -> (known after apply)
        id                = "113601808204"
        name              = "k8s-dev-worker-node-4"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[4] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601808187",
          - "113601808165",
        ] -> (known after apply)
        id                = "113601808202"
        name              = "k8s-dev-worker-node-5"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[5] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601808173",
          - "113601808160",
        ] -> (known after apply)
        id                = "113601808206"
        name              = "k8s-dev-worker-node-6"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[6] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601808188",
          - "113601808168",
        ] -> (known after apply)
        id                = "113601808219"
        name              = "k8s-dev-worker-node-7"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[7] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601808176",
          - "113601808170",
        ] -> (known after apply)
        id                = "113601808205"
        name              = "k8s-dev-worker-node-8"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 12 to add, 12 to change, 12 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>